Tekla Open API Reference for Tekla Structures 2025
ApplicationWindowBase Properties
The ApplicationWindowBase type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from WindowBase.)
LocExtension
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from WindowBase.)
UseDefaultStyle
 Use default style in all the window controls or not. If the property is not set in the window constructor the default value (true) is used.
 (Inherited from WindowBase.)
Top
See Also
Reference
ApplicationWindowBase Class
Tekla.Structures.Dialog Namespace